# coding=utf-8


CRI_EVI_TYPE = (
    (1, '书证'),
    (2, '物证'),
    (3, '证人证言'),
    (4, '被害人陈述'),
    (5, '犯罪嫌疑人、被告人供述和辩解'),
    (6, '鉴定意见'),
    (7, '勘验、检查、辨认、侦查实验等笔录'),
    (8, '视听资料、电子数据'),
)


CRI_EVI_SOURCE = (
    (1, '侦查机关'),
    (2, '刑事附带民事原告'),
    (3, '犯罪嫌疑人/被告人'),
    (4, '被害人'),
    (5, '法院调取'),
    (6, '其他人'),
)

CRI_ASK_TARGET = (
    (1, '犯罪嫌疑人/被告人'),
    (2, '同案犯'),
    (3, '检察机关'),
    (4, '证人'),
    (5, '被害人'),
    (6, '鉴定人'),
    (7, '侦查机关'),
    (8, '其他'),
)

ENFORCE_WAY = (
    (1, "行政拘留"),
    (2, "刑事拘留"),
    (3, "取保候审"),
    (4, "监视居住"),
)

ORG_CRIMINAL_LEGAL_STATUS = (
    (1, "犯罪嫌疑人"),
    (2, "被害人"),
)