# coding=utf-8


ORG_CHOICES = (
    ("1", "一审"),
    ("2", "二审"),
    ("3", "再审"),

)


Name_CHOICES = (
    ("1", "委托人"),
    ("2", "相对人"),
    ("3", "当事人"),
    ("4", "第三人"),
)

PROPERTY_CHOICES =(
    ("1", "法人"),
    ("2", "自然人"),
)

SEX_CHOICES = (
    ("1", u"男"),
    ("2", u"女"),
)


ORG_LEGAL_STATUS = (
    (1, "原告"),
    (2, "被告"),
    (7, "第三人"),
)


INFO_TYPE = (
    (0, "咨询"),
    (1, "代理"),
)

PERSON_TYPE = (
    (1, "第三人"),
    (2, "相对人"),
)

AGENT_TYPE = (
    (1, "普通代理"),
    (2, "风险代理"),
)

CASE_TYPE = (
    ("1", "民事案件"),
    ("2", "刑事案件"),
    ("3", "刑事自诉案件"),
    ("4", "刑事附带民事案件"),
    ("5", "行政案件"),
    ("6", "仲裁"),
    ("7", "执行"),
)


EVI_TYPE = (
    (1, '当事人陈述'),
    (2, '书证'),
    (3, '物证'),
    (4, '视听资料'),
    (5, '电子数据'),
    (6, '证人证言'),
    (7, '鉴定意见'),
    (8, '勘验笔录'),
)

EVI_SOURCE = (
    (1, '原告'),
    (2, '被告'),
    (3, '第三人'),
    (4, '法院调取'),
)

ASK_TARGET = (
    (1, '当事人'),
    (2, '相对人'),
    (3, '证人'),
    (4, '第三人'),
    (5, '鉴定人'),
)

CASE_PROPERTY = (
    (0, "个人"),
    (1, "公共"),
    (2, "公益"),
)

JUDGE_RESULT = (
    (1, '胜诉'),
    (2, '败诉'),
    (3, '发回重审'),
)

IS_ASSIGN = (
    (0, "待分配"),
    (1, "分配确认"),
)